{
    "data":[
        {
            "name_book":"Высоконагруженные приложения. Программирование, масштабирование, поддержка.",
            "author":"Клеппман Мартин",
            "publishing_house":"Sprint Book",
            "series":"Бестселлеры O'Reilly",
            "year_of_issue":2024,
            "description": "В этой книге вы найдете ключевые принципы, алгоритмы и компромиссы, без которых не обойтись при разработке высоконагруженных систем для работы с данными. Материал рассматривается на примере внутреннего устройства популярных программных пакетов и фреймворков. В книге три основные части, посвященные, прежде всего, теоретическим аспектам работы с распределенными системами и базами данных. От читателя требуются базовые знания SQL и принципов работы баз данных.",
            "img":"/images/7278387110.webp"
        },
        {
            "name_book":"Простой Python. Современный стиль программирования. 2-е изд.",
            "author":"Любанович Билл",
            "publishing_house":"Питер",
            "series":"Бестселлеры O'Reilly",
            "year_of_issue":2022,
            "description": "Простой Python» познакомит вас с одним из самых популярных языков программирования. Книга идеально подойдет как начинающим, так и опытным программистам, желающим добавить Python к списку освоенных языков. Любому программисту нужно знать не только язык, но и его возможности. Вы начнете с основ Python и его стандартной библиотеки. Узнаете, как находить, загружать, устанавливать и использовать сторонние пакеты. Изучите лучшие практики тестирования, отладки, повторного использования кода и получите полезные советы по разработке. Примеры кода и упражнения помогут в создании приложений для различных целей.",
            "img":"/images/7278420009.webp"
        },
        {
            "name_book":"Грокаем алгоритмы. 2-е изд.",
            "author":"Бхаргава Адитья",
            "publishing_house":"Питер",
            "series":"Библиотека программиста",
            "year_of_issue":2025,
            "description": "Алгоритмы - это пошаговые инструкции решения задач, большинство из которых уже были кем-то решены, протестированы и доказали свою эффективность. Второе издание 'Грокаем алгоритмы' упрощает изучение, понимание и использование алгоритмов. В этой книге вы найдете простые и внятные объяснения, более 400 забавных иллюстраций и десятки примеров. Ее чтение - лучший способ раскрыть всю мощь алгоритмов и подготовиться к интервью по программированию. Глубоких знаний математики не требуется! Вы узнаете о главных алгоритмах, позволяющих ускорить работу программ, упростить код и решить распространенные проблемы программирования. Начните с сортировки и поиска, а затем развивайте свои навыки для решения сложных задач, таких как сжатие данных и искусственный интеллект. Научитесь сравнивать эффективность различных алгоритмов. Во втором издании даны новые более подробные описания деревьев, NP-полные задачи, а код примеров обновлен на Python 3.",
            "img":"/images/7328691762.webp"
        },
        {
            "name_book":"Чистый код: создание, анализ и рефакторинг.",
            "author":"Роберт Мартин",
            "publishing_house":"Питер",
            "series":"-",
            "year_of_issue":2020,
            "description": "Плохой код может работать, но он будет мешать развитию проекта и компании-разработчика, требуя дополнительные ресурсы на поддержку и 'укрощение'. Каким же должен быть код? Эта книга полна реальных примеров, позволяющих взглянуть на код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Вы узнаете много нового о коде. Более того, научитесь отличать хороший код от плохого, узнаете, как писать хороший код и как преобразовать плохой код в хороший. Книга состоит из трех частей. Сначала вы познакомитесь с принципами, паттернами и приемами написания чистого кода. Затем приступите к практическим сценариям с нарастающей сложностью - упражнениям по чистке кода или преобразованию проблемного кода в менее проблемный. И только после этого перейдете к самому важному - концентрированному выражению сути этой книги - набору эвристических правил и 'запахов кода'. Именно эта база знаний описывает путь мышления в процессе чтения, написания и чистки кода.",
            "img":"/images/6950883641.webp"
        },
        {
            "name_book":"Сам себе программист. Как научиться программировать и устроиться в Ebay? ",
            "author":"Альтхофф Кори",
            "publishing_house":"Бомбора",
            "series":"Мировой компьютерный бестселлер",
            "year_of_issue":2024,
            "description": "Как за год научиться программировать и устроиться разработчиком в Ebay? Кори Альтхофф, автор книги «Сам себе программист», на собственном опыте знает, что это возможно, и делится знаниями с читателями. Альтхофф создал универсальный самоучитель, не похожий ни на один другой. На примере языка Python автор показывает, как буквально с первого урока можно приступить к созданию собственной небольшой программы, а к концу книги уверенно писать код. Помимо этого, вы узнаете, как успешно проходить собеседования на должность программиста в любой IT-компании и перестать сомневаться в собственных силах. Это прекрасное пособие для тех, кто хочет научиться программировать и планирует заниматься этим профессионально.",
            "img":"/images/6618767563.webp"
        },
        {
            "name_book":"Язык программирования C. Лекции и упражнения",
            "author":"Прата Стивен",
            "publishing_house":"Диалектика-Вильямс",
            "series":"-",
            "year_of_issue":2018,
            "description": "Эта книга представляет собой тщательно проверенное, хорошо продуманное и всеобъемлющее учебное пособие, предназначенное для программистов и разработчиков. Ставшая классикой, она обучает принципам программирования, в том числе структуризации кода и нисходящему проектированию. Автор и преподаватель Стивен Прата создал поучительное, ясное и проницательное введение в С. Наряду с деталями языка С объясняются фундаментальные концепции программирования. Многочисленные короткие практические примеры иллюстрируют только одну или две концепции за раз и поощряют читателей проработать новые темы, непосредственно приступив к их реальному использованию. Вопросы для самоконтроля и упражнения по программированию, приводимые в конце каждой главы, ориентированы на критически важные сведения и помогают читателям понять и систематизировать наиболее сложные концепции. Будучи дружественным и простым в чтении руководством, ориентированным на самостоятельное освоение, книга подойдет как студентам, изучающим программирование, так и разработчикам, которые специализируются на других языках и желают лучше понять основы этого базового языка. Шестое издание этой книги было обновлено и расширено с целью охвата последних наработок в языке С, а также раскрытия подробностей нового стандарта СИ. Здесь вы найдете углубленные, широкие и разнообразные подходы и инструменты, совершенствующие процесс изучения.",
            "img":"/images/7328611406.webp"
        }
    ]
}